Links 

* Official Documentation: https://pandas.pydata.org/pandas-docs/stable/reference/index.html
* How to Deal with Nulls: https://towardsdatascience.com/data-cleaning-how-to-handle-missing-values-in-pandas-cc8570c446ec

In [1]:
import pandas as pd
import os

### Display Options

In [2]:
pd.set_option("display.max_columns", 30)
pd.set_option("display.max_rows", 20) #Method 1
pd.set_option("max_rows", None) #Method 2
pd.set_option('display.float_format', lambda x: '%.1f' % x) #Method 1
pd.set_option('display.precision', 1) #Method 2
pd.set_option('display.colheader_justify', 'center')
pd.set_option('display.width', 1000)
pd.set_option('display.max_colwidth', 30) #Expand cell width

## Import

### Search the File

In [3]:
# Go back one directory
#os.chdir('../')

In [4]:
# Get current working directory
os.getcwd()

'c:\\Users\\aldan\\Desktop\\Study Notes\\1 - Python General'

In [5]:
# Search the file
file = 'itanic'

# Walk through the current working directory and subdirectories, returns (dirpath, [dirnames], [filenames])
for dirpath, dir_names_list, file_names_list in os.walk(os.getcwd()):
    for file_name in file_names_list:
        if file in file_name:
            path = os.path.join(dirpath, file_name)
            print (f'"{path}"')

"c:\Users\aldan\Desktop\Study Notes\1 - Python General\4.1 - Titanic.csv"

### Import the File

In [30]:
# Read
"""
pd.read_html, json, excel, etc

parse_dates = True, to treat dates
header = to select the header, default is first row, None to ignore
index_col to select column to index, default creates a column as index, 0 to create None

"""

df_original = pd.read_csv(path, index_col = 0)
df = df_original.copy()
df.head(3)

   survived  pclass   sex    age  sibsp  parch  fare embarked class   who    adult_male deck embark_town  alive  alone
0      0        3      male 22.0    1      0     7.2     S     Third    man      True    NaN  Southampton    no  False
1      1        1    female 38.0    1      0    71.3     C     First  woman     False      C    Cherbourg   yes  False
2      1        3    female 26.0    0      0     7.9     S     Third  woman     False    NaN  Southampton   yes   True

## Export

In [7]:
# Save
matrix = [['tom', 10], ['nick', 15], ['juli', 14]]
data_frame = pd.DataFrame(matrix, columns = ['Name', 'Age'])

to_csv = data_frame.to_csv("4.2 - data_example")

## Exploratory Methods

### Get Column Names

In [8]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town', 'alive', 'alone'], dtype='object')

### Get Info

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 99.2+ KB

### Get Data Types

In [10]:
df.dtypes

survived         int64
pclass           int64
sex             object
age            float64
sibsp            int64
parch            int64
fare           float64
embarked        object
class           object
who             object
adult_male        bool
deck            object
embark_town     object
alive           object
alone             bool
dtype: object

### Get Shape

In [11]:
df.shape

(891, 15)

### Get Null Values

In [12]:
df.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

### Unique Values

In [13]:
# List of Unique Values
df.fare.unique()[:3]

array([ 7.25  , 71.2833,  7.925 ])

### Number of Unique Values

In [14]:
# Len(Unique Values)
df.fare.nunique()

248

### Values with Frequency

In [15]:
# List of Unique Values with Frequency
df.fare.value_counts().head()

8.1     43
13.0    42
7.9     38
7.8     34
26.0    31
Name: fare, dtype: int64

### Slicing

#### String

In [16]:
#Cut the Last 2 Characters
df.who.str[:-2].head(3)

0      m
1    wom
2    wom
Name: who, dtype: object

#### Columns and Rows

In [17]:
df.filter(["who", "age", "sex"]).head(3)

   who    age   sex
0    man 22.0    male
1  woman 38.0  female
2  woman 26.0  female

In [18]:
df[["who", "age", "sex"]].head(3)

   who    age   sex
0    man 22.0    male
1  woman 38.0  female
2  woman 26.0  female

In [19]:
df.who.head(3)

0      man
1    woman
2    woman
Name: who, dtype: object

In [20]:
df["who"].head(3)

0      man
1    woman
2    woman
Name: who, dtype: object

In [21]:
df.loc[0:3,["pclass","sex","age"]]

   pclass   sex    age
0     3      male 22.0
1     1    female 38.0
2     3    female 26.0
3     1    female 35.0

In [22]:
df.iloc[0:3,[1,2,3]]

   pclass   sex    age
0     3      male 22.0
1     1    female 38.0
2     3    female 26.0

#### Index

In [23]:
df.index[:6]

Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')

### Filtering

#### Max() Value

In [24]:
# Creates a Ratio then find it's max value row
df.iloc[[(df.fare / df.age).idxmax()]]

     survived  pclass  sex   age  sibsp  parch  fare embarked class   who    adult_male deck embark_town  alive  alone
305      1        1    male 0.9     1      2   151.6     S     First  child     False     C   Southampton   yes  False

#### Min() Value

In [25]:
# Creates a Ratio then find it's min value row
df.iloc[[(df.fare / df.age).idxmin()]]

     survived  pclass  sex   age  sibsp  parch  fare embarked class  who   adult_male deck embark_town  alive  alone
179      0        3    male 36.0    0      0    0.0      S     Third  man     True     NaN  Southampton   no   True

#### Logic

In [26]:
# Filtering Boolean
(df.sex == "male").head(3)

0     True
1    False
2    False
Name: sex, dtype: bool

In [27]:
# Filtering Rows
df[df.sex == "male"].head(3)

   survived  pclass  sex   age  sibsp  parch  fare embarked class  who   adult_male deck embark_town  alive  alone
0      0        3    male 22.0    1      0    7.2      S     Third  man     True     NaN  Southampton   no   False
4      0        3    male 35.0    0      0    8.1      S     Third  man     True     NaN  Southampton   no    True
5      0        3    male  NaN    0      0    8.5      Q     Third  man     True     NaN   Queenstown   no    True

In [28]:
# Filtering Rows
df.loc[(df.sex == "male") & (df.pclass == 1)].head(3)

    survived  pclass  sex   age  sibsp  parch  fare embarked class  who   adult_male deck embark_town  alive  alone
6       0        1    male 54.0    0      0    51.9     S     First  man     True      E   Southampton    no   True
23      1        1    male 28.0    0      0    35.5     S     First  man     True      A   Southampton   yes   True
27      0        1    male 19.0    3      2   263.0     S     First  man     True      C   Southampton    no  False

In [29]:
# Filtering Rows
df.loc[(df.sex == "male") | (df.pclass == 1)].head(3)

   survived  pclass   sex    age  sibsp  parch  fare embarked class   who    adult_male deck embark_town  alive  alone
0      0        3      male 22.0    1      0     7.2     S     Third    man      True    NaN  Southampton    no  False
1      1        1    female 38.0    1      0    71.3     C     First  woman     False      C    Cherbourg   yes  False
3      1        1    female 35.0    1      0    53.1     S     First  woman     False      C  Southampton   yes  False

In [30]:
# Shift() = Previous Row 
# Creates a New Column with Value 'False' if Fare is not equal to the previous row
df.loc[df['fare'] != df["fare"].shift(), "is Fare Equal"] = "False"

df[df['is Fare Equal'] == 'False'].head(3)

   survived  pclass   sex    age  sibsp  parch  fare embarked class   who    adult_male deck embark_town  alive  alone is Fare Equal
0      0        3      male 22.0    1      0     7.2     S     Third    man      True    NaN  Southampton    no  False      False
1      1        1    female 38.0    1      0    71.3     C     First  woman     False      C    Cherbourg   yes  False      False
2      1        3    female 26.0    0      0     7.9     S     Third  woman     False    NaN  Southampton   yes   True      False

In [31]:
# Shift() = Previous Row 
# Creates a New Column with Value 'True' if Fare is equal to the previous row
df.loc[df['fare'] == df["fare"].shift(), "is Fare Equal"] = "True"

df[df['is Fare Equal'] == 'True'].head(3)

     survived  pclass  sex   age  sibsp  parch  fare embarked  class  who   adult_male deck embark_town  alive  alone is Fare Equal
90       0        3    male 29.0    0      0     8.1     S      Third  man     True     NaN  Southampton   no   True       True
101      0        3    male  NaN    0      0     7.9     S      Third  man     True     NaN  Southampton   no   True       True
191      0        2    male 19.0    0      0    13.0     S     Second  man     True     NaN  Southampton   no   True       True

#### Date

In [92]:
import datetime
# df[df.date.dt.year == 2020]

In [33]:
# df['net_amount'][(df.date < '2020-03-14') | (df.date > '2020-08-13')]

#### "Is in" and "Is not in"

In [34]:
# Filtering if embark town is in list and if pclass == 1
df.loc[df.embark_town.isin(['Southampton', 'Cherbourg']) & (df.pclass == 1)].head(3)

   survived  pclass   sex    age  sibsp  parch  fare embarked class   who    adult_male deck embark_town  alive  alone is Fare Equal
1      1        1    female 38.0    1      0    71.3     C     First  woman     False     C     Cherbourg   yes  False      False
3      1        1    female 35.0    1      0    53.1     S     First  woman     False     C   Southampton   yes  False      False
6      0        1      male 54.0    0      0    51.9     S     First    man      True     E   Southampton    no   True      False

In [35]:
# Filtering if embark town is not in list
df.loc[~df.embark_town.isin(['Southampton', 'Cherbourg'])].reset_index(drop=True).head(3)

   survived  pclass   sex    age  sibsp  parch  fare embarked class   who    adult_male deck embark_town alive  alone is Fare Equal
0      0        3      male  NaN    0      0     8.5     Q     Third    man      True    NaN  Queenstown    no   True      False
1      0        3      male  2.0    4      1    29.1     Q     Third  child     False    NaN  Queenstown    no  False      False
2      1        3    female 15.0    0      0     8.0     Q     Third  child     False    NaN  Queenstown   yes   True      False

#### 'Is NaN' and 'Not NaN'

In [36]:
# If deck is null
len(df.loc[df.deck.isnull()])

688

In [37]:
# If deck is not null
len(df.loc[df.deck.notnull()])

203

#### Top Values and Lower Values (Outliers)

In [38]:
# Finds the Value at the % 
qup, qdown = df.fare.quantile(0.95), df.fare.quantile(0.01)

# Filtering External (Outliers) Values
df[(df.fare < qup) & (df.fare > qdown)].sort_values(by = 'fare', ascending = False).head(3)

     survived  pclass   sex    age  sibsp  parch  fare embarked class   who    adult_male deck embark_town alive  alone is Fare Equal
581      1        1    female 39.0    1      1   110.9     C     First  woman     False      C   Cherbourg   yes  False      False
698      0        1      male 49.0    1      1   110.9     C     First    man      True      C   Cherbourg    no  False      False
306      1        1    female  NaN    0      0   110.9     C     First  woman     False    NaN   Cherbourg   yes   True      False

In [39]:
df[(df.fare < qup) & (df.fare > qdown)].sort_values(by = 'fare', ascending = False).tail(3)

     survived  pclass  sex   age  sibsp  parch  fare embarked class  who   adult_male deck embark_town  alive  alone is Fare Equal
326      0        3    male 61.0    0      0    6.2      S     Third  man     True     NaN  Southampton   no   True       False
872      0        1    male 33.0    0      0    5.0      S     First  man     True       B  Southampton   no   True       False
378      0        3    male 20.0    0      0    4.0      C     Third  man     True     NaN    Cherbourg   no   True       False

### Summary Functions

#### Describe Quantitative Data

In [40]:
# Describe Quantitative Data
df.describe(include='all')

        survived  pclass  sex    age  sibsp  parch  fare embarked class  who  adult_male deck embark_town  alive alone is Fare Equal
count    891.0    891.0    891 714.0 891.0  891.0  891.0    889      891  891     891     203          889   891   891        891
unique     NaN      NaN      2   NaN   NaN    NaN    NaN      3        3    3       2       7            3     2     2          2
top        NaN      NaN   male   NaN   NaN    NaN    NaN      S    Third  man    True       C  Southampton    no  True      False
freq       NaN      NaN    577   NaN   NaN    NaN    NaN    644      491  537     537      59          644   549   537        869
mean       0.4      2.3    NaN  29.7   0.5    0.4   32.2    NaN      NaN  NaN     NaN     NaN          NaN   NaN   NaN        NaN
std        0.5      0.8    NaN  14.5   1.1    0.8   49.7    NaN      NaN  NaN     NaN     NaN          NaN   NaN   NaN        NaN
min        0.0      1.0    NaN   0.4   0.0    0.0    0.0    NaN      NaN  NaN     NaN     NaN          NaN   NaN   NaN        NaN
25%        0.0      2.0    NaN  20.1   0.0    0.0    7.9    NaN      NaN  NaN     NaN     NaN          NaN   NaN   NaN        NaN
50%        0.0      3.0    NaN  28.0   0.0    0.0   14.5    NaN      NaN  NaN     NaN     NaN          NaN   NaN   NaN        NaN
75%        1.0      3.0    NaN  38.0   1.0    0.0   31.0    NaN      NaN  NaN     NaN     NaN          NaN   NaN   NaN        NaN
max        1.0      3.0    NaN  80.0   8.0    6.0  512.3    NaN      NaN  NaN     NaN     NaN          NaN   NaN   NaN        NaN

#### Standard Deviation

In [41]:
# Standard Deviation
df.fare.std()

49.6934285971809

#### Mean

In [42]:
# Mean
df.fare.mean()

32.204207968574636

#### Max

In [43]:
# Max
df.fare.max()

512.3292

#### Min

In [44]:
# Min
df.fare.min()

0.0

#### Correlation

In [45]:
# Correlation
df.corr()

            survived  pclass  age  sibsp  parch  fare  adult_male  alone
survived       1.0     -0.3  -0.1  -0.0    0.1    0.3     -0.6     -0.2
pclass        -0.3      1.0  -0.4   0.1    0.0   -0.5      0.1      0.1
age           -0.1     -0.4   1.0  -0.3   -0.2    0.1      0.3      0.2
sibsp         -0.0      0.1  -0.3   1.0    0.4    0.2     -0.3     -0.6
parch          0.1      0.0  -0.2   0.4    1.0    0.2     -0.3     -0.6
fare           0.3     -0.5   0.1   0.2    0.2    1.0     -0.2     -0.3
adult_male    -0.6      0.1   0.3  -0.3   -0.3   -0.2      1.0      0.4
alone         -0.2      0.1   0.2  -0.6   -0.6   -0.3      0.4      1.0

#### Arithmetic Operators

In [46]:
(df.fare - df.fare.mean())[:3]

0   -25.0
1    39.1
2   -24.3
Name: fare, dtype: float64

In [93]:
(df.fare * df.fare.mean())[:3]

0    233.5
1   2295.6
2    255.2
Name: fare, dtype: float64

#### Applying Map Function

In [47]:
# This 'centering' transformation is a common preprocessing step before applying various machine learning algorithm
df.fare.map(lambda p: p - df.fare.mean())[:3]

0   -25.0
1    39.1
2   -24.3
Name: fare, dtype: float64

In [48]:
# How many times "man" is written
df.who.map(lambda a: a == "man").sum()

537

#### Apply Function

In [49]:
df['fare'].apply(lambda p: p - df.fare.mean())[:3]

0   -25.0
1    39.1
2   -24.3
Name: fare, dtype: float64

#### Agg Functions

In [50]:
df.agg(['sum', 'min'])

     survived  pclass              sex                  age   sibsp  parch   fare              class                           who               adult_male             alive              alone          is Fare Equal
sum     342     2057   malefemalefemalefemalemale... 21205.2   466    340  28693.9  ThirdFirstThirdFirstThirdT...  manwomanwomanwomanmanmanma...      537    noyesyesyesnonononoyesyesy...    537  FalseFalseFalseFalseFalseF...
min       0        1                          female     0.4     0      0      0.0                          First                          child    False                               no  False                          False

In [51]:
df.agg({'age' : ['sum', 'min'], 'fare' : ['min', 'max']})

       age   fare
sum 21205.2   NaN
min     0.4   0.0
max     NaN 512.3

In [94]:
import numpy as np
df.agg(x=('age', max), y=('age', 'min'), z=('fare', np.mean))

   age  fare
x 80.0   NaN
y  0.4   NaN
z  NaN  32.2

### Sort Values

In [52]:
df.sort_values(by=['age', 'sex'], ascending=False).reset_index(drop=True)[:3]

   survived  pclass  sex   age  sibsp  parch  fare embarked class  who   adult_male deck embark_town  alive  alone is Fare Equal
0      1        1    male 80.0    0      0    30.0     S     First  man     True       A  Southampton   yes  True       False
1      0        3    male 74.0    0      0     7.8     S     Third  man     True     NaN  Southampton    no  True       False
2      0        1    male 71.0    0      0    34.7     C     First  man     True       A    Cherbourg    no  True       False

### Group Values

#### Using Pivot

In [34]:
# Set column as index if given the parameter 'index', then group by columns and count values
df.pivot(columns='sex', values='fare').head(5)

sex  female  male
0      NaN   7.2
1     71.3   NaN
2      7.9   NaN
3     53.1   NaN
4      NaN   8.1

#### Then Find its Mean

In [53]:
df.groupby(by=["who"]).age.mean()

who
child    6.4
man     33.2
woman   32.0
Name: age, dtype: float64

#### Then Count

In [54]:
# Method #1
df.groupby(by="who").count()

       survived  pclass  sex  age  sibsp  parch  fare  embarked  class  adult_male  deck  embark_town  alive  alone  is Fare Equal
who
child      83       83    83   83    83     83     83      83      83        83      13        83        83     83         83
man       537      537   537  413   537    537    537     537     537       537      99       537       537    537        537
woman     271      271   271  218   271    271    271     269     271       271      91       269       271    271        271

In [55]:
# Method #2
df.groupby('who').size()

who
child     83
man      537
woman    271
dtype: int64

#### Then Sum

In [56]:
df.groupby(by="who").sum()

       survived  pclass    age   sibsp  parch   fare   adult_male  alone
who
child      49      218    528.7   144    105   2721.2        0        6
man        88     1274  13700.5   159     82  13352.1      537      410
woman     205      565   6976.0   163    153  12620.7        0      121

#### Then Find then Min()

In [57]:
df.groupby(by="who").age.min()

who
child    0.4
man     16.0
woman   16.0
Name: age, dtype: float64

#### Then Find then Max()

In [58]:
# Hiding the Group (who:index)
df.groupby(by="who").age.max().reset_index(drop=True)

0   15.0
1   80.0
2   63.0
Name: age, dtype: float64

#### Then Apply a Function

In [59]:
# Group by multiple categorical columns then apply a function to find the rows with max age for each group
df.groupby(['who', 'sex']).apply(lambda f: f.loc[f.age.idxmax()])

              survived  pclass   sex    age  sibsp  parch  fare embarked class   who    adult_male deck embark_town  alive  alone is Fare Equal
who   sex
child female      1        3    female 15.0    0      0     8.0     Q     Third  child     False    NaN   Queenstown   yes   True      False
      male        0        3      male 15.0    1      1     7.2     C     Third  child     False    NaN    Cherbourg    no  False      False
man   male        1        1      male 80.0    0      0    30.0     S     First    man      True      A  Southampton   yes   True      False
woman female      1        1    female 63.0    1      0    78.0     S     First  woman     False      D  Southampton   yes  False      False

In [60]:
# Group by Who then Find the First Column 
# To check first entries, first paid fare, first embark town, etc
df.groupby('who').apply(lambda f: f.iloc[0])

       survived  pclass   sex    age  sibsp  parch  fare embarked class   who    adult_male deck embark_town  alive  alone is Fare Equal
who
child      0        3      male  2.0    3      1    21.1     S     Third  child     False    NaN  Southampton    no  False      False
man        0        3      male 22.0    1      0     7.2     S     Third    man      True    NaN  Southampton    no  False      False
woman      1        1    female 38.0    1      0    71.3     C     First  woman     False      C    Cherbourg   yes  False      False

#### Multiple Groups of Categorical Columns

In [61]:
df.groupby(['who',"sex"])['age'].max()

who    sex
child  female   15.0
       male     15.0
man    male     80.0
woman  female   63.0
Name: age, dtype: float64

#### Then Apply Agg

In [62]:
df.groupby(['who', 'sex']).age.agg([len, min, max]).reset_index().sort_values(by=["len", "sex"])

   who     sex    len  min  max
1  child    male   40  0.4 15.0
0  child  female   43  0.8 15.0
3  woman  female  271 16.0 63.0
2    man    male  537 16.0 80.0

In [63]:
df.groupby(['sex']).age.agg([len, min, max])

        len  min  max
sex
female  314 0.8  63.0
male    577 0.4  80.0

## Create

### From List

In [64]:
#From a List/Matrix
data_list = [['tom', 10], ['nick', 15], ['juli', 14]]
data_list = pd.DataFrame(data_list, columns = ['Name', 'Age'])
data_list

   Name  Age
0   tom  10
1  nick  15
2  juli  14

### From Two Lists or Tuples

In [65]:
#From 2 Lists or 2 Tuples
Name = ('tom', 'krish', 'nick', 'juli')
Age = (25, 30, 26, 22)
   
#Merge the 2 Objects into 1, Zip Creates a "Zip" Data-Type
pd.DataFrame(zip(Name, Age), columns = ['Names', 'Ages'])

  Names   Ages
0    tom   25
1  krish   30
2   nick   26
3   juli   22

### From Dictionary

In [66]:
#From a Dictionary with Personalized Index, Method #1
data_dict = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
 
pd.DataFrame(data_dict, index =['rank1','rank2','rank3','rank4'])

       Name   Age
rank1    Tom  20
rank2   nick  21
rank3  krish  19
rank4   jack  18

In [67]:
#From a Dictionary with Personalized Index, Method #2
data_dict = [{'name': 'Tom', 'age': 26, 'height':1.5},
        {'name':'nick', 'age': 20, 'height': 1.7}]

pd.DataFrame(data_dict, index =['rank1','rank2'])

       name  age  height
rank1   Tom  26    1.5
rank2  nick  20    1.7

In [68]:
#From a Dictionary with Personalized Index and Selected Columns, Method #3
data_dict = [{'name': 'Tom', 'age': 26, 'height':1.5},
        {'name':'nick', 'age': 20, 'height': 1.7}]
  
#Dropping C
data_dict = pd.DataFrame(data_dict, index =['first','second'], columns =['name', 'age'])

#Dropping C, B and Making a New One wit NaN Values
data_dict1 = pd.DataFrame(data_dict, index =['first','second'], columns =['age', 'b1'])

print (f"{data_dict} \n\n {data_dict1}")

        name  age
first    Tom  26
second  nick  20

         age  b1
first   26  NaN
second  20  NaN

### From Series

In [69]:
#Creating Using Series (Into Dict) with Personalized Index
data_dict_series = {'names' : pd.Series(['tom', 'nick', 'sara', 'mark'], index =['a', 'b', 'c', 'd']),
    'age' : pd.Series([10, 20, 30, 40], index =[1, 2, 3, 4])}
 
pd.DataFrame(data_dict_series)

  names  age
a   tom  NaN
b  nick  NaN
c  sara  NaN
d  mark  NaN
1   NaN 10.0
2   NaN 20.0
3   NaN 30.0
4   NaN 40.0

### Dummy

In [70]:
pd.get_dummies(df[['who', 'sex']]).head(3)

   who_child  who_man  who_woman  sex_female  sex_male
0      0         1         0           0          1
1      0         0         1           1          0
2      0         0         1           1          0

### Column From Another Column

In [71]:
# df['year'] = [str(l)[:4] for l in df['date']]
# df['month'] = [str(l)[5:7] for l in df['date']]
# df['day'] = [str(l)[8:10] for l in df['date']]

## Update

### Re-Order

In [72]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town', 'alive', 'alone', 'is Fare Equal'], dtype='object')

In [73]:
df[['sex', 'survived', 'pclass', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town', 'alive', 'alone']].head(3)

    sex    survived  pclass  age  sibsp  parch  fare embarked class   who    adult_male deck embark_town  alive  alone
0    male      0        3   22.0    1      0     7.2     S     Third    man      True    NaN  Southampton    no  False
1  female      1        1   38.0    1      0    71.3     C     First  woman     False      C    Cherbourg   yes  False
2  female      1        3   26.0    0      0     7.9     S     Third  woman     False    NaN  Southampton   yes   True

### Rename Columns

In [74]:
# From a Dict
df.rename(columns={'age': 'edad'}).head(3)

   survived  pclass   sex    edad  sibsp  parch  fare embarked class   who    adult_male deck embark_town  alive  alone is Fare Equal
0      0        3      male  22.0    1      0     7.2     S     Third    man      True    NaN  Southampton    no  False      False
1      1        1    female  38.0    1      0    71.3     C     First  woman     False      C    Cherbourg   yes  False      False
2      1        3    female  26.0    0      0     7.9     S     Third  woman     False    NaN  Southampton   yes   True      False

### Convert

#### To Numeric

In [75]:
# Convert to int and ignore NaN
df.loc[:3,["age",'fare']].astype(int, errors='ignore')

   age  fare
0  22     7
1  38    71
2  26     7
3  35    53

In [76]:
pd.to_numeric(df.loc[:3,"age"], downcast='integer', errors='coerce')

0    22
1    38
2    26
3    35
Name: age, dtype: int8

#### To Date

In [77]:
# pd.to_datetime(df['date'], format='%m/%d/%y')

### Naming the Columns and Row indexes

In [78]:
df.rename_axis("wines", axis='rows').rename_axis("fields", axis='columns').head(3)

fields  survived  pclass   sex    age  sibsp  parch  fare embarked class   who    adult_male deck embark_town  alive  alone is Fare Equal
wines
0           0        3      male 22.0    1      0     7.2     S     Third    man      True    NaN  Southampton    no  False      False
1           1        1    female 38.0    1      0    71.3     C     First  woman     False      C    Cherbourg   yes  False      False
2           1        3    female 26.0    0      0     7.9     S     Third  woman     False    NaN  Southampton   yes   True      False

### Set Index

In [79]:
df.rename(index={0: 'firstEntry', 1: 'secondEntry'}).head(3) #Set_index() is usually more convenient.

             survived  pclass   sex    age  sibsp  parch  fare embarked class   who    adult_male deck embark_town  alive  alone is Fare Equal
firstEntry       0        3      male 22.0    1      0     7.2     S     Third    man      True    NaN  Southampton    no  False      False
secondEntry      1        1    female 38.0    1      0    71.3     C     First  woman     False      C    Cherbourg   yes  False      False
2                1        3    female 26.0    0      0     7.9     S     Third  woman     False    NaN  Southampton   yes   True      False

In [80]:
df.set_index('survived').head(3)

          pclass   sex    age  sibsp  parch  fare embarked class   who    adult_male deck embark_town  alive  alone is Fare Equal
survived
0            3      male 22.0    1      0     7.2     S     Third    man      True    NaN  Southampton    no  False      False
1            1    female 38.0    1      0    71.3     C     First  woman     False      C    Cherbourg   yes  False      False
1            3    female 26.0    0      0     7.9     S     Third  woman     False    NaN  Southampton   yes   True      False

### Replace

#### Missing Values (Na/NaN)

In [81]:
#Replace NaN for "Unknown"
df.fillna("Unknown").head(3)

   survived  pclass   sex   age   sibsp  parch  fare embarked class   who    adult_male   deck   embark_town  alive  alone is Fare Equal
0      0        3      male 22.0    1      0     7.2     S     Third    man      True    Unknown  Southampton    no  False      False
1      1        1    female 38.0    1      0    71.3     C     First  woman     False          C    Cherbourg   yes  False      False
2      1        3    female 26.0    0      0     7.9     S     Third  woman     False    Unknown  Southampton   yes   True      False

#### Values for Another

In [82]:
#Update All Values from a Series to Another
df.pclass.replace(3, 6).head(3)

0    6
1    1
2    6
Name: pclass, dtype: int64

### Combine

#### Vertically

In [83]:
pclass1 = df.loc[df.pclass == 1][:3]
pclass1

   survived  pclass   sex    age  sibsp  parch  fare embarked class   who    adult_male deck embark_town  alive  alone is Fare Equal
1      1        1    female 38.0    1      0    71.3     C     First  woman     False     C     Cherbourg   yes  False      False
3      1        1    female 35.0    1      0    53.1     S     First  woman     False     C   Southampton   yes  False      False
6      0        1      male 54.0    0      0    51.9     S     First    man      True     E   Southampton    no   True      False

In [84]:
pclass2 = df.loc[df.pclass == 2][:3]
pclass2

    survived  pclass   sex    age  sibsp  parch  fare embarked  class   who    adult_male deck embark_town  alive  alone is Fare Equal
9       1        2    female 14.0    1      0    30.1     C     Second  child     False    NaN    Cherbourg   yes  False      False
15      1        2    female 55.0    0      0    16.0     S     Second  woman     False    NaN  Southampton   yes   True      False
17      1        2      male  NaN    0      0    13.0     S     Second    man      True    NaN  Southampton   yes   True      False

In [85]:
# Method #1
pclass1.append(pclass2, ignore_index=True)

   survived  pclass   sex    age  sibsp  parch  fare embarked  class   who    adult_male deck embark_town  alive  alone is Fare Equal
0      1        1    female 38.0    1      0    71.3     C      First  woman     False      C    Cherbourg   yes  False      False
1      1        1    female 35.0    1      0    53.1     S      First  woman     False      C  Southampton   yes  False      False
2      0        1      male 54.0    0      0    51.9     S      First    man      True      E  Southampton    no   True      False
3      1        2    female 14.0    1      0    30.1     C     Second  child     False    NaN    Cherbourg   yes  False      False
4      1        2    female 55.0    0      0    16.0     S     Second  woman     False    NaN  Southampton   yes   True      False
5      1        2      male  NaN    0      0    13.0     S     Second    man      True    NaN  Southampton   yes   True      False

In [86]:
# Method #2
pd.concat([pclass1, pclass2], ignore_index=True)

   survived  pclass   sex    age  sibsp  parch  fare embarked  class   who    adult_male deck embark_town  alive  alone is Fare Equal
0      1        1    female 38.0    1      0    71.3     C      First  woman     False      C    Cherbourg   yes  False      False
1      1        1    female 35.0    1      0    53.1     S      First  woman     False      C  Southampton   yes  False      False
2      0        1      male 54.0    0      0    51.9     S      First    man      True      E  Southampton    no   True      False
3      1        2    female 14.0    1      0    30.1     C     Second  child     False    NaN    Cherbourg   yes  False      False
4      1        2    female 55.0    0      0    16.0     S     Second  woman     False    NaN  Southampton   yes   True      False
5      1        2      male  NaN    0      0    13.0     S     Second    man      True    NaN  Southampton   yes   True      False

#### Horizontally

In [87]:
pclass1.set_index('who').join(pclass2.set_index('who'), rsuffix = "P2")

       survived  pclass   sex    age  sibsp  parch  fare embarked class   adult_male deck embark_town  alive  alone is Fare Equal  survivedP2  pclassP2  sexP2   ageP2  sibspP2  parchP2  fareP2 embarkedP2 classP2  adult_maleP2 deckP2 embark_townP2 aliveP2  aloneP2 is Fare EqualP2
who
man        0        1      male 54.0    0      0    51.9     S     First      True     E   Southampton    no   True      False          1          2       male   NaN      0        0      13.0       S      Second       True      NaN    Southampton    yes    True         False
woman      1        1    female 38.0    1      0    71.3     C     First     False     C     Cherbourg   yes  False      False          1          2     female  55.0      0        0      16.0       S      Second      False      NaN    Southampton    yes    True         False
woman      1        1    female 35.0    1      0    53.1     S     First     False     C   Southampton   yes  False      False          1          2     female  55.0      0        0      16.0       S      Second      False      NaN    Southampton    yes    True         False

#### Two Columns into One

In [88]:
# (Doesnt Modify the Original Dataframe)
df.sex[:3] + " - " + df.who[:3]

0        male - man
1    female - woman
2    female - woman
dtype: object

## Delete

### Columns

In [89]:
#Axis, 0: Rows, 1: Columns
df.drop(["sex", "age", "class"], axis = 1).head(3)

   survived  pclass  sibsp  parch  fare embarked  who    adult_male deck embark_town  alive  alone is Fare Equal
0      0        3      1      0     7.2     S       man      True    NaN  Southampton    no  False      False
1      1        1      1      0    71.3     C     woman     False      C    Cherbourg   yes  False      False
2      1        3      0      0     7.9     S     woman     False    NaN  Southampton   yes   True      False

### Rows with NaN Values

In [90]:
df.dropna().reset_index(drop=True)[:3]

   survived  pclass   sex    age  sibsp  parch  fare embarked class   who    adult_male deck embark_town  alive  alone is Fare Equal
0      1        1    female 38.0    1      0    71.3     C     First  woman     False     C     Cherbourg   yes  False      False
1      1        1    female 35.0    1      0    53.1     S     First  woman     False     C   Southampton   yes  False      False
2      0        1      male 54.0    0      0    51.9     S     First    man      True     E   Southampton    no   True      False